app/controllers/companies_controller.rb

  def index
    @companies = Company.paginate(:page => params[:page])
---
SELECT  "companies".* FROM "companies"  LIMIT 15 OFFSET 0
SELECT COUNT(*) FROM "companies"