app/controllers/offers_controller.rb

SELECT  "offers".* FROM "offers"   ORDER BY "offers"."id" ASC LIMIT 1000
SELECT COUNT(*) FROM "offers"
---
  def index
    @offers  = Offer.paginate(:page => params[:page])

SELECT  "offers".* FROM "offers"  WHERE "offers"."id" = $1 LIMIT 1  [["id", 2]]
---
    def set_offer
      @offer = Offer.find(params[:id])